# DATA FRAME

In [1]:
import pandas as pd

In [4]:
obj=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
obj

   A  B
0  1  4
1  2  5
2  3  6

In [5]:
obj.head()

   A  B
0  1  4
1  2  5
2  3  6

In [6]:
obj2=pd.read_csv('data.csv')

In [7]:
obj2

   1  2
0  1  3
1  1  4
2  2  1
3  2  1
4  3  1

In [8]:
obj2.head()

   1  2
0  1  3
1  1  4
2  2  1
3  2  1
4  3  1

In [18]:
obj3=pd.DataFrame([[1,2,3],[3,4,5]])
obj3

   0  1  2
0  1  2  3
1  3  4  5

In [25]:
obj3=pd.DataFrame({'A':[1,2],'b':[3,4]},columns=['b'])
obj3

   b
0  3
1  4

In [26]:
obj3=pd.DataFrame({'A':[1,2],'b':[3,4]},columns=['b','A'])
obj3

   b  A
0  3  1
1  4  2

In [27]:
obj3=pd.DataFrame({'A':[1,2],'b':[3,4]},columns=['b','a'])
obj3

   b    a
0  3  NaN
1  4  NaN

In [28]:
obj3=pd.DataFrame({'A':[1,2],'b':[3,4]},columns=['b'],index=['z','x'])
obj3

   b
z  3
x  4

In [29]:
obj

   A  B
0  1  4
1  2  5
2  3  6

In [31]:
obj['A']

0    1
1    2
2    3
Name: A, dtype: int64

In [32]:
obj.A

0    1
1    2
2    3
Name: A, dtype: int64

In [34]:
obj.B

0    4
1    5
2    6
Name: B, dtype: int64

In [36]:
obj.loc[0]

A    1
B    4
Name: 0, dtype: int64

In [37]:
obj['C']=obj['A']**2

In [38]:
obj

   A  B  C
0  1  4  1
1  2  5  4
2  3  6  9

In [39]:
s=pd.Series([1,2,3],index=[2,3,8])

In [40]:
s

2    1
3    2
8    3
dtype: int64

In [41]:
obj['D']=s

In [42]:
obj

   A  B  C    D
0  1  4  1  NaN
1  2  5  4  NaN
2  3  6  9  1.0

In [43]:
del obj["D"]

In [44]:
obj

   A  B  C
0  1  4  1
1  2  5  4
2  3  6  9

In [46]:
obj.index

RangeIndex(start=0, stop=3, step=1)

In [48]:
obj.name='hello'

In [49]:
obj.name

'hello'

In [50]:
obj

   A  B  C
0  1  4  1
1  2  5  4
2  3  6  9

In [51]:
obj.columns

Index(['A', 'B', 'C'], dtype='object')

In [52]:
type(obj.columns)

pandas.core.indexes.base.Index

In [53]:
type(obj.columns)==type(obj.index)

False

In [54]:
type(obj.index)

pandas.core.indexes.range.RangeIndex

In [55]:
obj2

   1  2
0  1  3
1  1  4
2  2  1
3  2  1
4  3  1

In [56]:
type(obj2.columns)

pandas.core.indexes.base.Index

In [57]:
type(obj2.index)

pandas.core.indexes.range.RangeIndex

In [58]:
obj2.columns

Index(['1', '2'], dtype='object')

In [59]:
obj2.T

   0  1  2  3  4
1  1  1  2  2  3
2  3  4  1  1  1

In [60]:
obj2

   1  2
0  1  3
1  1  4
2  2  1
3  2  1
4  3  1

In [61]:
obj

   A  B  C
0  1  4  1
1  2  5  4
2  3  6  9

In [62]:
obj.index.name='number'
obj.columns.name='alpha'
obj

alpha   A  B  C
number
0       1  4  1
1       2  5  4
2       3  6  9

In [63]:
obj2.values

array([[1, 3],
       [1, 4],
       [2, 1],
       [2, 1],
       [3, 1]], dtype=int64)

In [64]:
obj.values

array([[1, 4, 1],
       [2, 5, 4],
       [3, 6, 9]], dtype=int64)

In [67]:
obj['A']

number
0    1
1    2
2    3
Name: A, dtype: int64

In [68]:
obj['A']-obj["C"]

number
0    0
1   -2
2   -6
dtype: int64

In [69]:
abs(obj['A']-obj["C"])

number
0    0
1    2
2    6
dtype: int64

In [72]:
dic={'A':{200:2,100:1,300:3},'B':{300:30,100:10,400:40}}

In [77]:
d=pd.DataFrame(dic)
d

       A     B
200  2.0   NaN
100  1.0  10.0
300  3.0  30.0
400  NaN  40.0

In [82]:
d.sort_index()

       A     B
100  1.0  10.0
200  2.0   NaN
300  3.0  30.0
400  NaN  40.0

In [83]:
d

       A     B
200  2.0   NaN
100  1.0  10.0
300  3.0  30.0
400  NaN  40.0